tutorials/coriolisABLFoam/standardKepsilon/windVeering_FengAndGu2020_cyclicBCs_of1806+/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       13900;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       14400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    sideLeft
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       14900;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sideRight;
    }
    sideRight
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       15400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sideLeft;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       15900;
    }
    bottomRoughWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       16000;
    }
)

// ************************************************************************* //
