tutorials/coriolisABLFoam/standardKepsilon/windVeering_FengAndGu2020_cyclicBCs_of1806+/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{   
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            symmetryPlane;
    }

    bottomRoughWall
    {
        type            zeroGradient;
    }
    sideLeft
    {
        type            cyclic;
    }
    sideRight
    {
        type            cyclic;
    }
}

// ************************************************************************* //
