tutorials/coriolisABLFoam/standardKepsilon/windVeering_FengAndGu2020_cyclicBCs_of1806+/0/Ux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 15.5;

boundaryField
{
    inlet
    {
        type            cyclic;
        value           uniform 15.5;
    }
    outlet
    {
        type            cyclic;
        value           uniform 15.5;
    }
    sideLeft
    {
        type            cyclic;
        value           uniform 15.5;
    }
    sideRight
    {
        type            cyclic;
        value           uniform 15.5;
    }
    top
    {
        type            symmetryPlane;
        value           uniform 15.5;
    }
    bottomRoughWall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
